Revit 2018 API
Rebar Properties
The Rebar type exposes the following members.
Properties
Name | Description
ArrayLength |  Obsolete.
 Identifies the distribution path length of rebar set.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BarsOnNormalSide |  Obsolete.
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
BaseFinishingTurns |  Obsolete.
 For a spiral, the number of finishing turns at the lower end of the spiral.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DistributionType
 The type of rebar distribution(also known as Rebar Set Type).
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Height |  Obsolete.
 For a spiral, the overall height.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IncludeFirstBar
 Identifies if the first bar in rebar set is shown.
IncludeLastBar
 Identifies if the last bar in rebar set is shown.
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LayoutRule
 Identifies the layout rule of rebar set.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
MultiplanarDepth |  Obsolete.
 For a multiplanar rebar, the depth of the instance.
Name
A human readable name for the Element.
 (Inherited from Element.)
Normal |  Obsolete.
 A unit-length vector normal to the plane of the rebar
NumberOfBarPositions
 The number of potential bars in the set.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Pitch |  Obsolete.
 For a spiral, the pitch, or vertical distance traveled in one rotation.
Quantity
 Identifies the number of bars in rebar set.
ReadOnlyParameters
 When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
RebarShapeId |  Obsolete.
 The RebarShape element that defines the shape of the rebar.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
TopFinishingTurns |  Obsolete.
 For a spiral, the number of finishing turns at the upper end of the spiral.
TotalLength
 The length of an individual bar multiplied by Quantity.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
 The volume of an individual bar multiplied by Quantity.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace